# Data Handling using Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
# # How to create Series with nd array
# arr=np.array([10,15,18,22])
# s=pd.Series(arr)
# print(s)

In [3]:
# How to create Series with Mutable index
arr_1=np.array(['a','b','c','d'])
s_1=pd.Series(arr_1, index=['first','second','third','fourth'])
print(s_1)

first     a
second    b
third     c
fourth    d
dtype: object

In [4]:
# # Creating a series from Scalar value
# s=pd.Series(50, index=[0,1,2,3,4])
# print(s)

In [5]:
# Creating a series from a Dictionary

# create a dictionary
d = {'Name' : 'Hardik', 'Iplteam' : 'MI', 'Runs' : 1500}

# create a series
s = pd.Series(d)

print(s)

Name       Hardik
Iplteam        MI
Runs         1500
dtype: object

# Mathematical Operations in Series

In [6]:
# s=pd.Series([1,2,3,4,5])
# # Print all the values of the Series by multiplying them by
# print('To Multiply all values in a series by 2')
# print('----------------------------------------------------')
# print(s*2)
# # Print Square of all the values of the series.
# print('To Find the Square of all the values in a series')
# print('----------------------------------------------------')
# print(s**2)
# # Print all the values of the Series that are greater than 2.
# print( 'To print all the values in a series that are greater than 2')
# print('----------------------------------------------------')
# print(s[s>2])

In [3]:
import pandas as pd
s1=pd.Series([1,2,3],index=['a','b','c'])
s2=pd.Series([10,20,30],index=['a','b','d'])
s3=pd.Series([5,14,23],index=['a','d','e'])
# Print all the values of the Series by adding Series1 & Series2
print('To add Series1 & series2')
print('----------------------------------------------------')
print(s1+s2)
# Print all the values of the Series by adding Series2 & Series3
print('To add Series2 & series3')
print('----------------------------------------------------')
print(s2+s3)
# Print all the values of the Series by adding Series2 & Series3 and fill non matching index with 0
print( 'To add Series2 & Series3 and fill non matching index with 0')
print('----------------------------------------------------')
print(s2.add(s3,fill_value=0))

To add Series1 & series2
----------------------------------------------------
a    11.0
b    22.0
c     NaN
d     NaN
dtype: float64
To add Series2 & series3
----------------------------------------------------
a    15.0
b     NaN
d    44.0
e     NaN
dtype: float64
To add Series2 & Series3 and fill non matching index with 0
----------------------------------------------------
a    15.0
b    20.0
d    44.0
e    23.0
dtype: float64

# Head and Tail Functions in Series

In [8]:
arr=np.array([10,15,18,22,55,77,42,48,97])
# create a series from array
s=pd.Series(arr)
# print(s)

In [9]:
# to print first 5 rows
print(s.head())
# to print first 3 rows
print(s.head(3))

0    10
1    15
2    18
3    22
4    55
dtype: int32
0    10
1    15
2    18
dtype: int32

In [10]:
# to print last 5 rows
print(s.tail())
# to print last 4 rows
print(s.tail(4))

4    55
5    77
6    42
7    48
8    97
dtype: int32
5    77
6    42
7    48
8    97
dtype: int32

# Selection in Series

In [11]:
# arr=np.array([10,15,18,22,55,77])
# s=pd.Series(arr)
# print(s)

In [12]:
# Selection Using loc index label : series_name.loc[StartRange: StopRange]
print(s.loc[:2])
print(s.loc[3:4])
s.loc[2:3]

0    10
1    15
2    18
dtype: int32
3    22
4    55
dtype: int32

2    18
3    22
dtype: int32

In [13]:
# Selection Using iloc index label : series_name.iloc[StartRange : StopRange]
print(s.iloc[:2])
print(s.iloc[3:4])

0    10
1    15
dtype: int32
3    22
dtype: int32

In [14]:
# Selection Using [] : series_name[StartRange> : StopRange] or series_name[index]
print(s[1])
print('\n')
print(s[3:4])
s[:3]

15


3    22
dtype: int32

0    10
1    15
2    18
dtype: int32

# Indexing in Series

In [15]:
# arr=np.array(['a','b','c','d'],)
# s=pd.Series(arr,index=['first','second','third','fourth'])
# print(s)

In [16]:
# To print only indexed in series
print(s_1.index)

Index(['first', 'second', 'third', 'fourth'], dtype='object')

# Slicing in Series

In [17]:
# arr=np.array([10,15,18,22,55,77])
s=pd.Series(arr,index=['A','B','C','D','E','F','G','H','I'])
print(s)

A    10
B    15
C    18
D    22
E    55
F    77
G    42
H    48
I    97
dtype: int32

In [18]:
print(s[1:5:2])

B    15
D    22
dtype: int32

In [19]:
print(s[0:6:2])

A    10
C    18
E    55
dtype: int32

# DATAFRAME

In [20]:
# # How to create an empty Dataframe
# df=pd.DataFrame()
# print(df)

In [21]:
# # How to create Dataframe from series
# s=pd.Series(['a','b','c','d'])
# df=pd.DataFrame(s)
# print(df)

In [22]:
# DataFrame from Dictionary of Series
name=pd.Series(['Hardik','Virat'])
team=pd.Series(['MI','RCB'])
dic={'Name':name,'Team':team}
df=pd.DataFrame(dic)
print(df)

     Name Team
0  Hardik   MI
1   Virat  RCB

In [23]:
# DataFrame from List of Dictionaries
l=[{'Name':'Sachin','SirName':'Bhardwaj'},
   {'Name':'Vinod','SirName':'Verma'},
   {'Name':'Rajesh','SirName':'Mishra'}]
df1=pd.DataFrame(l)
print(df1)

     Name   SirName
0  Sachin  Bhardwaj
1   Vinod     Verma
2  Rajesh    Mishra

# Iteration on Rows and Columns

In [24]:
# iterrows()
for(row_index,row_value) in df1.iterrows():
    print('\nRow index is:',row_index)
    print('Row Values is:')
    print(row_value)

Row index is: 0
Row Values is:
Name         Sachin
SirName    Bhardwaj
Name: 0, dtype: object

Row index is: 1
Row Values is:
Name       Vinod
SirName    Verma
Name: 1, dtype: object

Row index is: 2
Row Values is:
Name       Rajesh
SirName    Mishra
Name: 2, dtype: object

In [25]:
# items()
for col_name, col_value in df1.items():
    print('\nColumn name is:', col_name)
    print('Column values are:')
    print(col_value)

Column name is: Name
Column values are:
0    Sachin
1     Vinod
2    Rajesh
Name: Name, dtype: object

Column name is: SirName
Column values are:
0    Bhardwaj
1       Verma
2      Mishra
Name: SirName, dtype: object

# Select operation in data frame

In [26]:
empdata={'empid':[101,102,103,104,105,106],
         'ename':['Sachin','Vinod','Lakhbir','Anil','Devinder','UmaSelvi'],
         'Doj':['12-01-2012','15-01-2012','05-09-2007','17-01-2012','05-09-2007','16-01-2012']}
df=pd.DataFrame(empdata)
print(df)

   empid     ename         Doj
0    101    Sachin  12-01-2012
1    102     Vinod  15-01-2012
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007
5    106  UmaSelvi  16-01-2012

In [27]:
# df.empid
df['empid']

0    101
1    102
2    103
3    104
4    105
5    106
Name: empid, dtype: int64

In [28]:
df[['empid','ename']]

   empid     ename
0    101    Sachin
1    102     Vinod
2    103   Lakhbir
3    104      Anil
4    105  Devinder
5    106  UmaSelvi

In [29]:
# displays first 5 row
print(df.head())

   empid     ename         Doj
0    101    Sachin  12-01-2012
1    102     Vinod  15-01-2012
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007

In [30]:
#  display last 5 rows
print(df.tail())

   empid     ename         Doj
1    102     Vinod  15-01-2012
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007
5    106  UmaSelvi  16-01-2012

In [31]:
# #  displays first 2 row
# print(df.head(2))

In [32]:
# # displays last 2 rows
# print(df.tail(2))

In [33]:
# display 2nd to 4th row
print(df[2:5])

   empid     ename         Doj
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007

# To Add & Rename a column in data frame

In [34]:
s = pd.Series([10,15,18,22])
df=pd.DataFrame(s)
df.columns=['List1'] # To Rename the default column of DataFrame as List1
df['List2']=20 # To create a new column List2 with all values as 20
df['List3']=df['List1']+df['List2'] # Add Column1 and Column2 and store in New column List3
print(df)

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

# To Delete a Column in data frame

In [35]:
df.pop('List2')

0    20
1    20
2    20
3    20
Name: List2, dtype: int64

In [36]:
df

   List1  List3
0     10     30
1     15     35
2     18     38
3     22     42

# To Delete a Column Using drop()

In [37]:
# s= pd.Series([10,20,30,40])
# df=pd.DataFrame(s)
# df.columns=['List1']
# df['List2']=40
# print(df)

In [38]:
df1=df.drop('List1',axis=1) # (axis=1) means to delete Data column wise
print("After deletion:")
print(df1)

After deletion:
   List3
0     30
1     35
2     38
3     42

In [39]:
df2=df.drop(index=[2,3],axis=0) # (axis=0) means to delete data row wise with given index
print ("After row deletion::")
print(df2)

After row deletion::
   List1  List3
0     10     30
1     15     35

# Accessing the data frame through loc()

In [40]:
Runs={'TCS':{'Qtr1':2500,'Qtr2':2000,'Qtr3':3000,'Qtr4':2000},
      'WIPRO':{'Qtr1':2800,'Qtr2':2400,'Qtr3':3600,'Qtr4':2400},
      'L&T':{'Qtr1':2100,'Qtr2':5700,'Qtr3':35000,'Qtr4':2100}}
df=pd.DataFrame(Runs)
print(df)

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000
Qtr4  2000   2400   2100

In [41]:
# To access a single row
print(df.loc['Qtr3',:])

TCS       3000
WIPRO     3600
L&T      35000
Name: Qtr3, dtype: int64

In [42]:
# to access multiple Rows Qtr1 to Qtr3
print(df.loc['Qtr1':'Qtr3',:])

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000

In [43]:
# To access a single column
print(df.loc[:,'TCS'])

Qtr1    2500
Qtr2    2000
Qtr3    3000
Qtr4    2000
Name: TCS, dtype: int64

In [44]:
# To access Multiple Column namely TCS and WIPR
print(df.loc[:,'TCS':'WIPRO'])

       TCS  WIPRO
Qtr1  2500   2800
Qtr2  2000   2400
Qtr3  3000   3600
Qtr4  2000   2400

In [45]:
# check if the DataFrame has any rows
if len(df.index) > 0:
    # access the first row using .loc with the label of the first row
    print(df.loc[df.index[0]])
else:
    print("DataFrame is empty")

TCS      2500
WIPRO    2800
L&T      2100
Name: Qtr1, dtype: int64

In [46]:
# To access first 3 Rows with a DatetimeIndex
df.loc[df.index[0:3]]

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000

# Accessing the data frame through iloc()

In [47]:
# To access First two Rows and Second column
print(df.iloc[0:2,1:2])

      WIPRO
Qtr1   2800
Qtr2   2400

In [48]:
# To access all Rows and First two columnn Record
print(df.iloc[:,0:2])

       TCS  WIPRO
Qtr1  2500   2800
Qtr2  2000   2400
Qtr3  3000   3600
Qtr4  2000   2400

# Boolean Indexing in Data Frame

In [49]:
dic={'Name':['Sachin Bhardwaj','Vinod Verma','Rajesh Mishra'],
     'Age':[32,35,48]}
# creating a DataFrame with boolean index vector
df=pd.DataFrame(dic, index=[True,False,True])
print(df)

                  Name  Age
True   Sachin Bhardwaj   32
False      Vinod Verma   35
True     Rajesh Mishra   48

In [50]:
# to return DataFRame where index is True
print(df.loc[True])
print()

                 Name  Age
True  Sachin Bhardwaj   32
True    Rajesh Mishra   48

In [51]:
print('Result of iloc method')
print(df.iloc[1])

Result of iloc method
Name    Vinod Verma
Age              35
Name: False, dtype: object

# Concat operation in data frame

In [52]:
dic1={'id':['1','2','3','4','5'],
       'Value1':['A','C','E','G','I'],
       'Value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],
       'Value1':['K','M','O','Q','S'],
       'Value2':['L','N','P','R','T']}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)

In [53]:
df3=pd.concat([df1,df2])
print(df3)

  id Value1 Value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [54]:
# to adjust row labels automatically, set ignore_index to True
df3=pd.concat([df1,df2],ignore_index=True)
print(df3)

  id Value1 Value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J
5  2      K      L
6  3      M      N
7  6      O      P
8  7      Q      R
9  8      S      T

In [55]:
# an option to label the DataFrame
merge={'Data1':df1,'Data2':df2}
df3=pd.concat(merge)
print(df3)

        id Value1 Value2
Data1 0  1      A      B
      1  2      C      D
      2  3      E      F
      3  4      G      H
      4  5      I      J
Data2 0  2      K      L
      1  3      M      N
      2  6      O      P
      3  7      Q      R
      4  8      S      T

In [56]:
# to concatenate DataFrames along column, specify the axis parameter as 1
df3=pd.concat([df1,df2],axis=1)
print(df3)

  id Value1 Value2 id Value1 Value2
0  1      A      B  2      K      L
1  2      C      D  3      M      N
2  3      E      F  6      O      P
3  4      G      H  7      Q      R
4  5      I      J  8      S      T

# Merge operation in data frame

In [57]:
dic3={'id':['1','2','3','4','5','7','8','9','10','11'],
       'Value3':[12,13,14,15,16,17,15,12,13,23]}
df3=pd.concat([df1,df2])
df4=pd.DataFrame(dic3)

In [58]:
# join df3 and df4 on the 'id' column
df5 = pd.merge(df3, df4, on='id')

# print the resulting DataFrame
print(df5)

  id Value1 Value2  Value3
0  1      A      B      12
1  2      C      D      13
2  2      K      L      13
3  3      E      F      14
4  3      M      N      14
5  4      G      H      15
6  5      I      J      16
7  7      Q      R      17
8  8      S      T      15

In [59]:
# # Merge df3 and df4 on the 'id' column
# # Specify 'id' as the column to join on for both DataFrames using left_on and right_on parameters
# df5 = pd.merge(df3, df4, left_on='id', right_on='id')

# # Print the resulting merged DataFrame
# print(df5)

# Join operation in data frame

In [61]:
# merge df1 and df2 based on the 'id' column using outer join
df3 = pd.merge(df1, df2, on='id', how='outer')

# print the resulting DataFrame
print(df3)

  id Value1_x Value2_x Value1_y Value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        E        F        M        N
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN
5  6      NaN      NaN        O        P
6  7      NaN      NaN        Q        R
7  8      NaN      NaN        S        T

In [62]:
# Merge df1 and df2 based on the 'id' column using outer join
df3 = pd.merge(df1, df2, 
               left_on='id',    # join on the 'id' column in the left DataFrame (df1)
               right_on='id',   # join on the 'id' column in the right DataFrame (df2)
               how='outer',     # use outer join to include all rows from both DataFrames
               suffixes=('_left', '_right')  # add suffixes to the column names to distinguish between the two DataFrames
              )

# Print the resulting DataFrame
print(df3)

  id Value1_left Value2_left Value1_right Value2_right
0  1           A           B          NaN          NaN
1  2           C           D            K            L
2  3           E           F            M            N
3  4           G           H          NaN          NaN
4  5           I           J          NaN          NaN
5  6         NaN         NaN            O            P
6  7         NaN         NaN            Q            R
7  8         NaN         NaN            S            T

In [63]:
# merge df1 and df2 based on the 'id' column using inner join
df3 = pd.merge(df1, df2, on='id', how='inner')

# print the resulting DataFrame
print(df3)

  id Value1_x Value2_x Value1_y Value2_y
0  2        C        D        K        L
1  3        E        F        M        N

In [64]:
# merge df1 and df2 based on the 'id' column using right join
df3 = pd.merge(df1, df2, on='id', how='right')

# print the resulting DataFrame
print(df3)

  id Value1_x Value2_x Value1_y Value2_y
0  2        C        D        K        L
1  3        E        F        M        N
2  6      NaN      NaN        O        P
3  7      NaN      NaN        Q        R
4  8      NaN      NaN        S        T

In [65]:
# merge df1 and df2 based on the 'id' column using left join
df3 = pd.merge(df1, df2, on='id', how='left')

# print the resulting DataFrame
print(df3)

  id Value1_x Value2_x Value1_y Value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        E        F        M        N
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN

In [66]:
# joining on Index
df3 = pd.merge(df1, df2, right_index=True,left_index=True)

# print the resulting DataFrame
print(df3)

  id_x Value1_x Value2_x id_y Value1_y Value2_y
0    1        A        B    2        K        L
1    2        C        D    3        M        N
2    3        E        F    6        O        P
3    4        G        H    7        Q        R
4    5        I        J    8        S        T

# CSV File

In [67]:
# making DataFrame
df=pd.read_csv("emp.csv")
print(df)

   empid             ename         doj
0    101  Sachine Bhardwaj  12-01-2012
1    102       Vinod Verma  15-01-2012
2    103      Anand Ganesh  05-09-2007

In [68]:
# Exporting data from dataframe to CSV File
df1=pd.DataFrame(l)
df1.to_csv('DataFrame1.csv')

# Data cleaning

In [69]:
# Create a sample dataframe with empty values
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Dave', 'Eve', 'Frank', 'Grace'],
        'Age': [20, 35, 24, 28, None, 42, 18],
        'City': ['New York', None, 'Paris', 'Sydney', 'Tokyo', 'London', None]}
df = pd.DataFrame(data)
df.to_csv('DataFrame2.csv')

In [70]:

df=pd.read_csv('DataFrame2.csv')

# Drop rows with any empty cells and create a new dataframe
new_df = df.dropna()

# Print the new dataframe
print(new_df.to_string())

   Unnamed: 0     Name   Age      City
0           0    Alice  20.0  New York
2           2  Charlie  24.0     Paris
3           3     Dave  28.0    Sydney
5           5    Frank  42.0    London

In [71]:
# To change the original DataFrame, use the inplace=True argument:
# Remove all rows with NULL values
df.dropna(inplace=True)

# Print the resulting DataFrame
print(df.to_string())

   Unnamed: 0     Name   Age      City
0           0    Alice  20.0  New York
2           2  Charlie  24.0     Paris
3           3     Dave  28.0    Sydney
5           5    Frank  42.0    London

# Data of Wrong Format

In [72]:
"""
Cells with data of wrong format can make it difficult, or even impossible, to 
analyze data.
To fix it, you have two options: 
    i. remove the rows 
    ii. convert all cells in the columns into the same format.
convert all cells in the 'Date' column into dates.
"""
df = pd.read_csv('data.csv')
df['Date'] = pd.to_datetime(df['Date'])

print(df.to_string())

     Name       Date   Duration
0    John 2022-01-01         30
1    Mary 2022-02-01         40
2   Steve 2022-03-01         50
3  Rachel 2022-04-01         60
4     Tom 2022-05-01         70
5   Sarah 2022-06-01         80
6    Mike 2022-07-01         90
7     Amy 2022-08-01        100
8   David 2022-09-01        110
9     Bob 2022-10-01  two hours

In [73]:
# Pandas - Fixing Wrong Data
df = pd.read_csv('data.csv')
df.loc[9,'Duration'] = 120

print(df.to_string())

     Name        Date Duration
0    John  2022-01-01       30
1    Mary  2022-02-01       40
2   Steve  2022-03-01       50
3  Rachel  2022-04-01       60
4     Tom  2022-05-01       70
5   Sarah  2022-06-01       80
6    Mike  2022-07-01       90
7     Amy  2022-08-01      100
8   David  2022-09-01      110
9     Bob  2022-10-01      120